[
  {
    "id": "0229379a-1cdf-40f7-9a9c-f580c3e0c296",
    "title": "Physics",
    "cover": "subject_covers/subject-1.jpg",
    "caption": "Unlock the mysteries of the universe with your first steps into the world of Physics! Explore the physical quantities, fundamentals of motion, speed, projectiles, and force as you journey into the science that shapes our world."
  },
  {
    "id": "a0c23e00-17ea-4c2b-a85f-cca67ab03856",
    "title": "الفيزياء",
    "cover": "subject_covers/subject-2.jpg",
    "caption": ""
  },
  {
    "id": "633fdfaf-a6b7-400b-a5da-9071394d9e14",
    "title": "Physics",
    "cover": "subject_covers/subject-3.jpg",
    "caption": "This syllabus provides an in-depth journey into the core principles of physical science, focusing on the behavior of waves, the dynamics of fluids, and the fundamental laws governing heat and gases. Students will engage with essential concepts that explain the movement of energy, the interactions of matter, and the forces that drive natural phenomena. From the oscillations of waves to the fluid flow in dynamic systems and the laws that dictate gas behavior, this syllabus equips students with a foundational understanding of the physical world, laying the groundwork for advanced study and practical application in scientific and engineering fields."
  },
  {
    "id": "a88a0b52-4c35-4b7f-be31-1b878b78ec54",
    "title": "Physics",
    "cover": "subject_covers/subject-4.jpg",
    "caption": "This syllabus introduces the foundational concepts of modern electricity, magnetism, and physics that govern both everyday technologies and advanced scientific discoveries."
  },
  {
    "id": "6d41dd01-d6f3-4264-a192-77079ef9029a",
    "title": "الفيزياء",
    "cover": "subject_covers/subject-5.jpg",
    "caption": ""
  },
  {
    "id": "625550db-3458-4070-bb0d-b7df997798c9",
    "title": "الفيزياء",
    "cover": "subject_covers/subject-6.jpg",
    "caption": ""
  }
]